#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_policy.rds_read_write_policy: Refreshing state... [id=arn:aws:iam::655643325852:policy/fastfood-rds-read-write-20250325004757129700000001]
data.aws_db_instances.all: Reading...
aws_vpc.main: Refreshing state... [id=vpc-03be10e3194244af3]
data.aws_vpcs.all: Reading...
aws_iam_role.rds_access_role: Refreshing state... [id=fastfood-rds-access-20250325004757130600000002]
data.aws_db_subnet_group.existing[0]: Reading...
data.aws_vpcs.all: Read complete after 0s [id=us-east-1]
data.aws_security_groups.rds[0]: Reading...
data.aws_vpc.existing[0]: Reading...
data.aws_subnets.private[0]: Reading...
data.aws_internet_gateway.existing[0]: Reading...
data.aws_route_tables.existing[0]: Reading...
data.aws_db_subnet_group.existing[0]: Read complete after 0s [id=fastfood-rds-subnet-group]
data.aws_db_instances.all: Read complete after 0s [id=us-east-1]
data.aws_db_instance.existing[0]: Reading...
data.aws_internet_gateway.existing[0]: Read complete after 0s [id=igw-07993616f770396e5]
data.aws_route_tables.existing[0]: Read complete after 0s [id=us-east-1]
data.aws_security_groups.rds[0]: Read complete after 0s [id=us-east-1]
data.aws_security_group.rds[0]: Reading...
data.aws_subnets.private[0]: Read complete after 0s [id=us-east-1]
data.aws_security_group.rds[0]: Read complete after 0s [id=sg-068ebfbe3b77e1e5c]
aws_iam_role_policy_attachment.attach_rds_policy: Refreshing state... [id=fastfood-rds-access-20250325004757130600000002-20250325004757499700000003]
data.aws_db_instance.existing[0]: Read complete after 0s [id=fastfood-db]
data.aws_vpc.existing[0]: Read complete after 1s [id=vpc-03be10e3194244af3]
aws_route_table.private: Refreshing state... [id=rtb-06440a7d02eed1263]
aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0ffdce38c358af153]
aws_internet_gateway.gw: Refreshing state... [id=igw-07993616f770396e5]
aws_security_group.rds_sg: Refreshing state... [id=sg-068ebfbe3b77e1e5c]
aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-06ec74580df6e2d05]
aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-0076d63bc31b2a7c7]
aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-007564bdf51f6cfae]
aws_route_table.public: Refreshing state... [id=rtb-0973df71e84154b0b]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=fastfood-rds-subnet-20250325004940241700000004]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03ec5e212d10693cb]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00d2f1c4b7b1aa9e9]
aws_db_instance.postgres: Refreshing state... [id=db-LERMI2NJZUGBI5TABK25Y4S74A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "fastfood-nat-eip"
        }
      + tags_all             = {
          + "Name" = "fastfood-nat-eip"
        }
      + vpc                  = (known after apply)
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-06ec74580df6e2d05"
      + tags                               = {
          + "Name" = "fastfood-nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "fastfood-nat-gateway"
        }
    }

  # aws_route.private_nat_gateway will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-06440a7d02eed1263"
      + state                  = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-06440a7d02eed1263"
      + subnet_id      = "subnet-0ffdce38c358af153"
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-06440a7d02eed1263"
      + subnet_id      = "subnet-007564bdf51f6cfae"
    }

  # aws_security_group.rds_sg will be updated in-place
  ~ resource "aws_security_group" "rds_sg" {
        id                     = "sg-068ebfbe3b77e1e5c"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = [
                  - "200.215.64.70/32",
                ]
              - description      = "hen"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "terraform-20250325004927195500000002"
        tags                   = {
            "Name" = "fastfood-rds-security-group"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>